---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.DemandFactor
source: html/62cc842b-21cc-6505-ee9c-67749c49ea16.htm
---
# Autodesk.Revit.DB.SpecTypeId.DemandFactor Property

Demand Factor, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId DemandFactor { get; }
```